import {
  ImageListProps,
  allProductsType,
  footerLinksType,
} from "@/_slice/type";

export const navbarLinks = [
  {
    id: "1",
    name: "زنانه",
    url: "/",
  },
  {
    id: "3",
    name: "مردانه",
    url: "/",
  },
  {
    id: "4",
    name: "بچگانه",
    url: "/",
  },
  {
    id: "5",
    name: "آرایشی",
    url: "/",
  },
];
export const footerLinks: footerLinksType[] = [
  {
    id: 1,
    title: "همراه با کاستومی",
    links: [
      {
        id: 12,
        name: "فروش محصولات",
        path: "./",
      },
      {
        id: 13,
        name: "فرصت همکاری",
        path: "./",
      },
      {
        id: 14,
        name: "تماس با ما",
        path: "./",
      },
      {
        id: 15,
        name: "نقشه سایت",
        path: "./",
      },
    ],
  },
  {
    id: 2,
    title: "خدمات مشتریان",
    links: [
      {
        id: 21,
        name: "سوالات متداول",
        path: "./",
      },
      {
        id: 22,
        name: "حریم خصوصی",
        path: "./",
      },
      {
        id: 23,
        name: "ثبت شکایت",
        path: "./",
      },
      {
        id: 24,
        name: "ضمانت نامه محصولات",
        path: "./",
      },
    ],
  },
  {
    id: 3,
    title: "راهنمای خرید",
    links: [
      {
        id: 31,
        name: "راهنمای ثبت سفارش",
        path: "./",
      },
      {
        id: 32,
        name: "شیوه های پرداخت",
        path: "./",
      },
      {
        id: 33,
        name: "نحوه ارسال سفارش ها",
        path: "./",
      },
      {
        id: 34,
        name: "شرایط بازگرداندن محصول",
        path: "./",
      },
    ],
  },
];
export const CategoriesImages = [
  {
    id: "1",
    image: "https://www.modiseh.com/media/wysiwyg/payiz1402/Kids_2.png",
  },
  {
    id: "2",
    image: "https://www.modiseh.com/media/wysiwyg/payiz1402/Cosmetics_1.png",
  },
  {
    id: "3",
    image: "/images/men s clothing.jpeg",
  },
  {
    id: "4",
    image: "/images/women s clothing.jpeg",
  },
];
export const specialSaleData: ImageListProps[] = [
  {
    img: "/images/_3_.webp",
    title: "آرایشی",
    rows: 4,
    cols: 4,
  },
  {
    img: "/images/tile21_4_.webp",
    title: "بچگانه",
    rows: 2,
    cols: 2,
  },
  {
    img: "/images/tile3_4_.webp",
    title: "زنانه",
    rows: 2,
    cols: 2,
  },
];
export const journalData: ImageListProps[] = [
  {
    img: "/images/women_landing3_1_.webp",
    title: "زنانه",
    rows: 3,
    cols: 2,
  },
  {
    img: "/images/women_landing4_1_.webp",
    title: "زنانه",
    rows: 3,
    cols: 4,
  },
  {
    img: "/images/women_landing2_1_.webp",
    title: "زنانه",
    rows: 3,
    cols: 4,
  },
  {
    img: "/images/women_landing_1_.webp",
    title: "زنانه",
    rows: 3,
    cols: 2,
  },
];
// {
//   "title": "کیف زنانه کرم روشن بیسراک ",
//   "price": 530000,
//   "description": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
//   "category": "زنانه",
//   "image": "https://drive.google.com/file/d/1GClJtdnazVQIUth5bzYZN32gLSlpSPsY/view?usp=drive_link",
//   "rating": 15,
//   "count": 8,
//   "discount": 34,
//   "id": "5"
// },
// {
//   "title": "پیراهن مردانه رسمی",
//   "price": 580000,
//   "description": " چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
//   "category": "مردانه",
//   "image": "https://drive.google.com/file/d/1wWfp9GMLCTrf0tXCppbUw7wP6ni4Y5ag/view?usp=drive_link",
//   "rating": 4.7,
//   "count": 21,
//   "discount": 14,
//   "id": "6"
// },
// {
//   "title": "ساعت مچی مردانه اسپرت",
//   "price": 1250000,
//   "description": " چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
//   "category": "مردانه",
//   "image": "https://drive.google.com/file/d/1ZdI4HHwJsSTvS_7B_d8OGWh7y-8MbmmB/view?usp=drive_link",
//   "rating": 4.9,
//   "count": 17,
//   "discount": 34,
//   "id": "7"
// },
// {
//   "title": "عطر مردانه خنک",
//   "price": 790000,
//   "description": " چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
//   "category": "مردانه",
//   "image": "https://drive.google.com/file/d/1ZdI4HHwJsSTvS_7B_d8OGWh7y-8MbmmB/view?usp=drive_link",
//   "rating": 4.6,
//   "count": 45,
//   "discount": 24,
//   "id": "8"
// },
// {
//   "title": "لباس بچگانه دخترانه گلدار",
//   "price": 280000,
//   "description": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد",
//   "category": "بچگانه",
//   "image": "https://drive.google.com/file/d/1ZdI4HHwJsSTvS_7B_d8OGWh7y-8MbmmB/view?usp=drive_link",
//   "rating": 5,
//   "count": 14,
//   "discount": 7,
//   "id": "9"
// },
// {
//   "title": "اسباب بازی ماشین کنترلی",
//   "price": 390000,
//   "description": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد",
//   "category": "بچگانه",
//   "image": "https://drive.google.com/file/d/1ZdI4HHwJsSTvS_7B_d8OGWh7y-8MbmmB/view?usp=drive_link",
//   "rating": 4.8,
//   "count": 29,
//   "discount": 37,
//   "id": "10"
// },
// {
//   "title": "ریمل حجم دهنده مژه",
//   "price": 180000,
//   "description": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
//   "category": "آرایشی",
//   "image": "https://drive.google.com/file/d/1ZdI4HHwJsSTvS_7B_d8OGWh7y-8MbmmB/view?usp=drive_link",
//   "rating": 4.6,
//   "count": 36,
//   "discount": 8,
//   "id": "11"
// },
// {
//   "title": " رژ لب جامد مات",
//   "price": 135000,
//   "description": "رژ لب جامد مات با رنگبندی متنوع و ماندگاری بالا",
//   "category": "آرایشی",
//   "image": "https://drive.google.com/file/d/1ZdI4HHwJsSTvS_7B_d8OGWh7y-8MbmmB/view?usp=drive_link",
//   "rating": 4.9,
//   "count": 52,
//   "discount": 23,
//   "id": "12"
// },
// {
//   "title": " کرم پودر ضد آفتاب",
//   "price": 250000,
//   "description": "کرم پودر ضد آفتاب با پوشش دهی بالا و SPF مناسب",
//   "category": "آرایشی",
//   "image": "https://drive.google.com/file/d/1ZdI4HHwJsSTvS_7B_d8OGWh7y-8MbmmB/view?usp=drive_link",
//   "rating": 4.7,
//   "count": 18,
//   "discount": 19,
//   "id": "13"
// }
